![sslogo](https://github.com/stratascratch/stratascratch.github.io/raw/master/assets/sslogo.jpg)

# An Introduction to Pandas

To edit this notebook:
- Save the notebook by selecting `Download .ipynb` from the `File` tab
- Go to [Colaboratory](https://colab.research.google.com/) and upload the notebook from the `File` tab
- Alternatively, you can import the notebook to your Google Drive and select `Open with` when you right-click. Select `Colaboratory` or `+ Connect more apps` to install Colaboratory first

## Basic Pandas Concepts

Some very basic Pandas and python concepts to get started

#### Import the pandas package

In [0]:
import pandas as pd

#### Create a simple DataFrame

- syntax: pd.DataFrame({column1 : value1, column2 : value2, column3 : value3})

You can have anything as column names and anything as values.

The only requirement is to have all value lists being of equal length (all are of length 3 in this example)

There are many ways to create a data frame and you will see some more during the course. All of them can be seen documented [here](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html).

In [2]:
df = pd.DataFrame({'name':['Bob','Jen','Tim'],
                   'age':[20,30,40],
                   'pet':['cat', 'dog', 'bird']})

df

  name  age   pet
0  Bob   20   cat
1  Jen   30   dog
2  Tim   40  bird

#### View the column names and index values

The index is one of the most important concepts in pandas. 

Each dataframe has only a single index which is always available as `df.index` and if you do not supply one (as we did not for this dataframe) a new one is made automatically. 

Indexes define how to access rows of the dataframe. 

The simplest index is the range index but there are more complex ones like interval index, datetime index and multi index. 

We will explore indexes more in depth during the course of this lecture.

In [3]:
print(df.columns)
print(df.index)

Index(['name', 'age', 'pet'], dtype='object')
RangeIndex(start=0, stop=3, step=1)

#### Select a column by name in 2 different ways

These two ways are equivalent and can be used interchangeably almost always.

The primary exception is when the name of the column contains spaces. If for example we had a column called "weekly sales" we have to use df['weekly sales'] because `df.weekly sales` is a syntactic error.

In [4]:
print(df['name'])
print(df.name)

0    Bob
1    Jen
2    Tim
Name: name, dtype: object
0    Bob
1    Jen
2    Tim
Name: name, dtype: object

#### Select multiple columns

To select multiple columns we use `df[columns_to_select]` where `columns_to_select` are the columns we are interested in given as a simple python list. As the result we will get another data frame. 

This is the equivalent of listing columns names in `SELECT` part of a sql query.

In [5]:
df[['name','pet']]

  name   pet
0  Bob   cat
1  Jen   dog
2  Tim  bird

#### Select a row by index

Regular selection of rows goes via its index. When using range indices we can access rows using integer indices but this will not work when using datetime index for example.

We can always access any row in the dataframe using `.iloc[i]` for some integer i. 

The result is a series object from which we can access values by using column indexing.

In [6]:
df.iloc[0]

name    Bob
age      20
pet     cat
Name: 0, dtype: object

### Sort Function

- pandas.pydata.org
- https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_values.html

#### Sort the data by pet

There are two ways to sort.
- By index
- By value

By value means sorting according to value in a column. 

In this example we sort the rows of the dataframe based on values in 'pet' column.

The parameter `ascending = True` means that we want the rows sorted in ascending order. This is the same as sql 'ASC'. To get descending order use `ascending = False`.

`inplace` is very important and you should always remember it. When `inplace=True` the dataframe is modified in place which means that no copies are made and your previous data stored in the dataframe is lost. By default inplace is always False. When it is false a copy is made of your data and that copy is sorted and returned as output. 

The output of `sort_values` is always a dataframe returned but the behaviour depends strongly on the `inplace` parameter.

In [0]:
df.sort_values('pet',inplace=True, ascending=True)

### Indexing with DataFrames

Everything we discussed about indexing in numpy arrays applies to dataframes as well.

DataFrames are very similar to 2d-arrays with the main exception being that in DataFrames you can index using strings (column names).

#### View the index after the sort

In [8]:
df

  name  age   pet
2  Tim   40  bird
0  Bob   20   cat
1  Jen   30   dog

#### Difference between loc and iloc

- `.loc` selection is based on the value of the index. For example if the index was categorical we could index via some category. 
- `.iloc` selection is **always** based on integer positions. When using iloc we are treating the dataframe as 2d-array with no special structure compared to the case of `.loc`

In [9]:
df.loc[0] #index based

name    Bob
age      20
pet     cat
Name: 0, dtype: object

In [10]:
df.iloc[0] #relative position based indexing

name     Tim
age       40
pet     bird
Name: 2, dtype: object

#### Use iloc to select all rows of a column

This will select all rows of the second column.

Remember `:` = `::1`

First index is always row and second is always column when dealing with dataframes.

In [11]:
df.iloc[:,2]

2    bird
0     cat
1     dog
Name: pet, dtype: object

#### Use iloc to select the last row

In [12]:
df.iloc[-1,:]

name    Jen
age      30
pet     dog
Name: 1, dtype: object

## Basic Pandas Concept Exercises

In [0]:
sales = [100,130,119,92,35]
customer_account = ['B100','J101','X102','P103','R104']
city = ['BOS','LA','NYC','SF','CHI']

#### Create a DataFrame with the data above

In [14]:
df=pd.DataFrame(zip(sales,customer_account,city), columns=['sales','customer_account','city'])
df

   sales customer_account city
0    100             B100  BOS
1    130             J101   LA
2    119             X102  NYC
3     92             P103   SF
4     35             R104  CHI

#### What is the name of the first column?

In [15]:
df.columns[0]

'sales'

#### Sort the DataFrame by city in descending order (check the documentation for sort)

In [0]:
df.sort_values(by='city', ascending=False, inplace=True)

In [18]:
df

   sales customer_account city
3     92             P103   SF
2    119             X102  NYC
1    130             J101   LA
4     35             R104  CHI
0    100             B100  BOS

#### Which customer is in the last row of the DataFrame?

In [0]:
df.reset_index(inplace=True, drop=True)

In [0]:
df.drop('index', axis=1, inplace=True)

In [26]:
df

   sales customer_account city
0     92             P103   SF
1    119             X102  NYC
2    130             J101   LA
3     35             R104  CHI
4    100             B100  BOS

In [32]:
df.iloc[-1]['customer_account']

'B100'

#### Reorder the columns with customer in the first column

In [0]:
df.insert(0, 'customer_account', df['customer_account'], allow_duplicates=True)

In [40]:
df

  customer_account  sales customer_account city
0             P103     92             P103   SF
1             X102    119             X102  NYC
2             J101    130             J101   LA
3             R104     35             R104  CHI
4             B100    100             B100  BOS

In [0]:
df.columns=['customer_account','sales','customer_account1','city']

In [0]:
df.drop('customer_account1', axis=1, inplace=True)

In [45]:
df

  customer_account  sales city
0             P103     92   SF
1             X102    119  NYC
2             J101    130   LA
3             R104     35  CHI
4             B100    100  BOS

# Basic Pandas Functionality 

Before we learn about what Pandas can do, we need to first import some data

## Importing Data

Python allows you to connect to any type of database. To make this easy for newbies, we've create a notebook to help you connect to the Strata Scratch platform and pull data. Use the notebook below to pull data from our database.

[Connect to Strata Scratch with Python](https://colab.research.google.com/drive/1VtywiAAI-ucfTzBa6YDca8k4gfGiEPnn)

### Install the Database Module

The code below installs a postgres database module to allow our notebook to connect to the Strata Scratch database

In [46]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in /usr/local/lib/python3.6/dist-packages (2.7.6.1)

### Import Required Modules

Import a few required modules that enables us to query data and perform analytics

In [47]:
import numpy as np
import pandas as pd
import psycopg2 as ps

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

### Connect to Strata Scratch

Make sure to enter your username and database password. Your database password is not the same as your login password. You can find your database password in the Profile tab once logged into Strata Scratch.

In [49]:
host_name = 'db-strata.stratascratch.com'
dbname = 'db_strata'
port = '5432'
user_name = 'ankit082006' #enter username
pwd = 'ofkMQPktC' #enter your database password found in the profile tab in Strata Scratch

try:
    conn = ps.connect(host=host_name,database=dbname,user=user_name,password=pwd,port=port)
except ps.OperationalError as e:
    raise e
else:
    print('Connected!')

Connected!

### Pull the Titanic Dataset From Strata Scratch

#### Enter SQL code below to pull the dataset you're interested in

If you get an error, it likely means that the connection timed out. Try connecting to Strata Scratch again before executing the code below.

A list of datasets is found in SQL LAB in Strata Scratch.

In [0]:
#Write SQL below to pull datasets 
cur = conn.cursor()
cur.execute(""" 
            SELECT *  FROM titanic; 
            """)
data = cur.fetchall()
colnames = [desc[0] for desc in cur.description] 
conn.commit()

#create the pandas dataframe
data = pd.DataFrame(data)
data.columns = colnames

#close the connection
cur.close()

#### Check To See If Your Pulled The Dataset

The Titanic dataset should be in a pandas dataframe named `data`

In [51]:
data.head()

   passengerid  survived  pclass  ...     fare cabin embarked
0            1         0       3  ...   7.2500  None        S
1            2         1       1  ...  71.2833   C85        C
2            3         1       3  ...   7.9250  None        S
3            4         1       1  ...  53.1000  C123        S
4            5         0       3  ...   8.0500  None        S

[5 rows x 12 columns]

## Basic Pandas Functionality

Now that we imported some data, let's take a look at what Pandas can do

#### Investigate the first few rows of data

The `head` method by default prints the first 5 rows of your dataframe.

If you pass it a parameter `n` it will print first `n` rows. 

The docs are [here](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.head.html)

In [52]:
data.head()

   passengerid  survived  pclass  ...     fare cabin embarked
0            1         0       3  ...   7.2500  None        S
1            2         1       1  ...  71.2833   C85        C
2            3         1       3  ...   7.9250  None        S
3            4         1       1  ...  53.1000  C123        S
4            5         0       3  ...   8.0500  None        S

[5 rows x 12 columns]

#### Investigate the last 10 rows of data

tail is similar to head except it prints the last `n` rows.

In [53]:
data.tail(10)

     passengerid  survived  pclass  ...     fare cabin embarked
881          882         0       3  ...   7.8958  None        S
882          883         0       3  ...  10.5167  None        S
883          884         0       2  ...  10.5000  None        S
884          885         0       3  ...   7.0500  None        S
885          886         0       3  ...  29.1250  None        Q
886          887         0       2  ...  13.0000  None        S
887          888         1       1  ...  30.0000   B42        S
888          889         0       3  ...  23.4500  None        S
889          890         1       1  ...  30.0000  C148        C
890          891         0       3  ...   7.7500  None        Q

[10 rows x 12 columns]

#### Investigate the data types in the DataFrame

This method will tell you the types of columns.

Types are automatically inferred by pandas and usually you do not have to worry about them.

[docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.info.html)

In [54]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
passengerid    891 non-null int64
survived       891 non-null int64
pclass         891 non-null int64
name           891 non-null object
sex            891 non-null object
age            714 non-null object
sibsp          891 non-null int64
parch          891 non-null int64
ticket         891 non-null object
fare           891 non-null float64
cabin          204 non-null object
embarked       889 non-null object
dtypes: float64(1), int64(5), object(6)
memory usage: 83.7+ KB

#### Get some summary statistics

To learn more about describe visit [this link](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.describe.html)

In [55]:
data.describe().T

             count        mean         std  ...       50%    75%       max
passengerid  891.0  446.000000  257.353842  ...  446.0000  668.5  891.0000
survived     891.0    0.383838    0.486592  ...    0.0000    1.0    1.0000
pclass       891.0    2.308642    0.836071  ...    3.0000    3.0    3.0000
sibsp        891.0    0.523008    1.102743  ...    0.0000    1.0    8.0000
parch        891.0    0.381594    0.806057  ...    0.0000    0.0    6.0000
fare         891.0   32.204208   49.693429  ...   14.4542   31.0  512.3292

[6 rows x 8 columns]

### Filtering Dataframes

You can filter data based on the columns and values in the dataframe

#### Filter the data for men

There are two pieces of the puzzle here:
- `data.sex=='male'` will give a boolean array where True means that row has a column called sex which has value 'male'. This numpy array is called the predicate.
- data[data.sex=='male'] will give back all rows for which the predicate holds true.

The result of this filter is a dataframe with same columns as the input dataframe.

In [56]:
data[data.sex=='male']

     passengerid  survived  pclass  ...     fare cabin embarked
0              1         0       3  ...   7.2500  None        S
4              5         0       3  ...   8.0500  None        S
5              6         0       3  ...   8.4583  None        Q
6              7         0       1  ...  51.8625   E46        S
7              8         0       3  ...  21.0750  None        S
..           ...       ...     ...  ...      ...   ...      ...
883          884         0       2  ...  10.5000  None        S
884          885         0       3  ...   7.0500  None        S
886          887         0       2  ...  13.0000  None        S
889          890         1       1  ...  30.0000  C148        C
890          891         0       3  ...   7.7500  None        Q

[577 rows x 12 columns]

#### Filter the ages for the men

Again there are two important parts:
- `data.sex=='male'` is the predicate as before
- `data.age` means taking the values for the age column, and `data.age[data.sex=='male']` means taking all ages which are related to male rows.

The result of this is pandas series **not** a dataframe.

In [57]:
data.age[data.sex=='male']

0        22
4        35
5      None
6        54
7         2
       ...
883      28
884      25
886      27
889      26
890      32
Name: age, Length: 577, dtype: object

### Adding methods to filters

A method is a function and is used frequently when analyzing data in Pandas. There are countless Pandas methods. We'll go over a few of the basic ones to show how you can use methods to quickly analyze your data.

#### How many men and women were on the Titanic?

The pipeline always goes the same way
- Predicate is evalatued
- Data is filtered according to a predicate
- An aggregate value is computed after the filtering.

The count method simply counts the number of frames in the dataframe.

In [58]:
data.sex[data.sex=='male'].count()

577

In [59]:
data.sex[data.sex=='female'].count()

314

#### What was the survival rate for adult men (age>=18)

Here we combine predicates using the and operator (&).

This operator applies the logical and operation between elements at matching positions.

For example: 
- x = np.array([True, False, True, True]) 
- y = np.array([False, True, False, True])
- will give x & y = np.array([True & False, False & True, True & False, True & True]).

In the following example we use the or combiner (|).

You can combine any two boolean numpy arrays as long as they have the same shape using the & and | operators.

Combining regular python lists this way does not work.

In [60]:
data.survived[(data.sex=='male')&(data.age>=18)].mean()

0.17721518987341772

#### What was the survival rate for women and children?

The mean method is the same as AVERAGE in SQL.

In [61]:
data.survived[(data.sex=='female')|(data.age<18)].mean()

0.6881720430107527

#### Use groupby to compare the survival rates of men and women

The `groupby` method is one of the most important tools you will use in your day to day work.

It's main input parameter is either a string denoting a column name or a list of strings denoting a list of column names.

It's output is a GroupBy object which is very similar to a dataframe.

The operation of groupby is the same as SQL GROUPBY.

For more info see the [docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html).

In [62]:
data.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

#### Create a DataFrame with groupby

In [64]:
new = data.groupby(['sex','pclass'])['survived','age'].mean()
new

               survived
sex    pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

## Importing and Exporting Data with Pandas

#### Pandas has easy to use functions for importing and exporting different data types: 
- CSV Files 
- Excel Worksheets
- Queries from Databases

Strata Scratch notebooks will exclusively be import data from our platform so we will not be covering other import techniques.

## More Basic Pandas Exercises

#### What was the average age of the survivors?

In [67]:
data[data['survived']==1]['age'].mean()

28.343689655172415

#### What was the combined survival rate of both children (age less than 18) and seniors (age greater than 60)?

In [68]:
data[(data['survived']==1) & ((data['age']<18) | (data['age']>60))]

     passengerid  survived  pclass  ...     fare cabin embarked
9             10         1       2  ...  30.0708  None        C
10            11         1       3  ...  16.7000    G6        S
22            23         1       3  ...   8.0292  None        Q
39            40         1       3  ...  11.2417  None        C
43            44         1       2  ...  41.5792  None        C
..           ...       ...     ...  ...      ...   ...      ...
830          831         1       3  ...  14.4542  None        C
831          832         1       2  ...  18.7500  None        S
853          854         1       1  ...  39.4000   D28        S
869          870         1       3  ...  11.1333  None        S
875          876         1       3  ...   7.2250  None        C

[66 rows x 12 columns]

In [74]:
(len(data[(data['survived']==1) & ((data['age']<18) | (data['age']>60))])/len(data[(data['survived']==1)]))*100

19.298245614035086

#### Group by pClass and investigate average survival rate, age and fare

In [77]:
data.groupby(by='pclass')['survived','age','fare'].mean()

        survived       fare
pclass
1       0.629630  84.154687
2       0.472826  20.662183
3       0.242363  13.675550

#### Create a CSV with the names and ages of the surivors and another CSV file with the names and ages of the deceased. Please refer to documention (to_csv method) to complete the exercise.

[Documentation for the method](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_csv.html)

In [0]:
data[(data['survived']==1)][['name','age']].to_csv('survival_data.csv')